# DATABASE

In [1]:
pwd

'E:\\BINAR\\Binar-Gold-Challenge\\API\\DataBase'

In [2]:
import sqlite3

## Connect to database

In [3]:
conn = sqlite3.connect("Database_processing.db")
print("Opened database successfully")

Opened database successfully

## Create Table

### input_text Table

In [4]:
conn.execute( '''
    CREATE TABLE input_text (
        text VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [5]:
conn.execute( '''
    CREATE TABLE output_text (
        text VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [6]:
conn.execute( '''
    CREATE TABLE input_Tweet (
        Tweet VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [7]:
conn.execute( '''
    CREATE TABLE clean_Tweet (
        Tweet VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [35]:
conn.close()

## SHOW VALUES in TABLES

In [10]:
import pandas as pd

In [ ]:
conn = sqlite3.connect("Database_processing.db")

In [17]:
df_input_text = pd.read_sql_query('SELECT * FROM input_text', conn)
df_input_text

                                                text
0  - disaat semua cowok berusaha melacak perhatia...
1  RT USER: USER siapa yang telat ngasih tau elu?...

In [18]:
df_output_text = pd.read_sql_query('SELECT * FROM output_text', conn)
df_output_text

                                                text
0  disaat semua cowok berusaha melacak perhatian ...
1  siapa yang telat ngasih tau elu edan sarap gue...

In [19]:
df_input_Tweet = pd.read_sql_query('SELECT * FROM input_Tweet', conn)
df_input_Tweet

                                                   Tweet
0      - disaat semua cowok berusaha melacak perhatia...
1      RT USER: USER siapa yang telat ngasih tau elu?...
2      41. Kadang aku berfikir, kenapa aku tetap perc...
3      USER USER AKU ITU AKU\n\nKU TAU MATAMU SIPIT T...
4      USER USER Kaum cebong kapir udah keliatan dong...
...                                                  ...
13164  USER jangan asal ngomong ndasmu. congor lu yg ...
13165                       USER Kasur mana enak kunyuk'
13166  USER Hati hati bisu :( .g\n\nlagi bosan huft \...
13167  USER USER USER USER Bom yang real mudah terdet...
13168  USER Mana situ ngasih(": itu cuma foto ya kuti...

[13169 rows x 1 columns]

In [16]:
df_input_Tweet = pd.read_sql_query('SELECT * FROM clean_Tweet', conn)
df_input_Tweet

Empty DataFrame
Columns: [Tweet]
Index: []

sorces: https://www.youtube.com/watch?v=tPxUSWTvZAs&t=421s

https://www.youtube.com/watch?v=tPxUSWTvZAs&t=421s

https://mungingdata.com/sqlite/create-database-load-csv-python/

multiple file: https://www.geeksforgeeks.org/how-to-upload-file-in-python-flask/

single file = https://blog.miguelgrinberg.com/post/handling-file-uploads-with-flask

https://flask.palletsprojects.com/en/2.3.x/patterns/fileuploads/